Revit 2027 API
ParameterTypeId.PointElementNormalizedSegmentLength Property
 "Normalized Segment Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointElementNormalizedSegmentLength { get; }
Public Shared ReadOnly Property PointElementNormalizedSegmentLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointElementNormalizedSegmentLength {
	ForgeTypeId^ get ();
}
static member PointElementNormalizedSegmentLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace